console.log('number' + 3 + 3); // Результат number33 - 'number' є рядком, за операцією конкатенції рядків з числом, вираз набуває значення 'number3', при додаванні наступної трійки - 'number33' .
console.log(null + 3); // Результат 3 - null приймає значення 0 при виконанні арифметичної операції, 0+3=3.
console.log(5 && "qwerty"); // Результат qwerty - відсутня умова виконання операції логічного І - виводиться останнє значення.
console.log(+'40' + +'2' + "hillel"); // 42hillel - '40' та '2' перетворюються на числа через наявність оператора +, 40+2=42 і конкатенується з рядком "hillel".
console.log('10' - 5 === 6); // Результат false - '10' перетворюється на число 10 через оператор -, 10-5=5, 5 не дорівнює 6.
console.log(true + false); // Результат 1 - true приймає значення 1, false приймає значення 0, 1+0=1.
console.log('4px' - 3); // Результат NaN - '4px' має перетворитися у число через -, але не перетворюється, т.я. наявні літери окрім цифр, відповідно виводиться NaN.
console.log('4' - 3); // Результат 1 - '4' перетворюється на число 4 через -, 4-3=1.
console.log('6' + 3 ** 0); // Результат 61 - '6' конкатенується з 3 в степені 0, 3 у степені 0=1, рядок '6'+1='61'.
console.log(12 / '6'); // Результат 2 - '6' перетворюється на число 6 - операція ділення, 12/6=2.
console.log('10' + (5 === 6)); // Результат 10false - 5 не дорівнює 6, виводиться false, конкатенується з '10'.
console.log(null == ''); // Результат false - null при порівнянні з пустим рядком не належать до одного типу, відповідно, після виконання порівняння виводиться false.
console.log (3 ** (9 / 3)); // Результат 27 - 9/3=3, 3 у степені 3=27.
console.log (!!'false' == !!'true'); // Результат true - 'false' та 'true' перетворюються на true через наявність оператора !!, т.я. вони не пусті, відповідно виводиться true.
console.log (0 || '0' && 1); // Результат 1 - спочатку виконується логічна операція &&, рядок з нулем є правдивим значенням, тому виводиться 1, при подальшому порівнянні 0||1=1, т.я. || повертає перше правдиве значення.
console.log ((+null == false) < 1); // Результат false - null при перетворенні на число через оператор + стає 0, false=0, 0==0, true стає 1, вираз 1<1=false.
console.log (false && true || true); // Результат true - спочатку виконується операція &&, false && true=false, false || true=true.
console.log (false && (false || true)); // Результат false - спочатку виконується операція в дужках з операцією ||, false || true=true, false && true=false через оператор && - при наявності false виводить false.
console.log ((+null == false) < 1 ** 5);   // Результат false - null при перетворенні на число через оператор + стає 0, false=0, 0==0, 1 у степені 5=1, вираз 1<1=false.
